
###### 1 ######
# להשתמש טבלת נתונים בשם 
# iris 
# ולחשב עבור כל אחד מארבעה העמודות הראשונות את הממוצע, הערך המינימום והמקסימום


###### 2 ######
# להשתמש טבלת נתונים בשם 
# mtcars 
# ולבצע את 33החישובים הבאים


# mpg השורש של העמודה 


# disp  של העמודה log


#   בחזקת שלוש wt


###### 3 ######
#  "+" ליצור שרשור של הערכים הבאים מחוברים עם הסימן	

s1 <- c("age", "gender", "height", "weight")

###### 4 ######
#  חשבו את הממוצע של המטריצה הבאה לפי עמודה, שורה ושל המטריצה כולה

m1 <- matrix(c(4,7,-8,3,0,-2,1,-5,12,-3,6,9), ncol=4)


###### 5 ######
#  (Z-ל A-מ) לכתוב לולאה שמדפיסה את האותיות באנגלית בסדר הפוך

###### 6 ######
# לכתוב לולאה שמדפיס מספרים שלמים בין 1 ל-10 באופן אקראי ולעצור כאשר המספר 8 מופיע בפעם הראשונה.
# תעשו זאת בשתי שיטות: פעם אחת עם לולאה
#   for
# ופעם אחרת עם לולאה 
#   while. 
# ניתן להשתמש בפונקציה
#   sample 
# או בפונקציה
#   runif 
# כדי לייצר את המספרים האקראיים.


###### 7 ######
# בהינתן שני הווקטורים הבאים, בעזרת לולאה תחברו את המילים שבהם למשפט אחת כך שכל פעם מדלגים בין הווקטורים.

a <- c("well", "you", "merged", "vectors", "one") 
b <- c("done", "have", "two", "into", "phrase")


###### 7 ######
# השתמשו בטבלת 
# iris 
# כדי ליצור את הגרפים הבאים


#  היסטוגרמה עבור ארבעה המשתנים הראשונים


# Species גרף עוגה עם המשתנה 


# גרף של
# Petal.Length
# מול
# Petal.Width 
# ולצבוע לפי
# Species


#  ליצור
# boxplot 
# של 
# Sepal.Length 
# לפי 
# Species


